In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
from pyspark.sql.types import *
from pyspark.sql.window import Window
import os

print("="*70)
print("PYSPARK FUNDAMENTALS - STEP BY STEP TUTORIAL")
print("="*70)

======================================================================
PYSPARK FUNDAMENTALS - STEP BY STEP TUTORIAL
======================================================================

In [2]:

print("\n" + "="*70)
print("STEP 1: CREATE SPARK SESSION")
print("="*70)

spark = SparkSession.builder \
    .appName("PySpark Fundamentals") \
    .master("local[*]") \
    .config("spark.sql.shuffle.partitions", "4") \
    .getOrCreate()

spark.sparkContext.setLogLevel("ERROR")

print("âœ… Spark Session Created!")
print(f"   App Name: {spark.sparkContext.appName}")
print(f"   Spark Version: {spark.version}")
print(f"   Master: {spark.sparkContext.master}")

======================================================================
STEP 1: CREATE SPARK SESSION
======================================================================

WARNING: Using incubator modules: jdk.incubator.vector
Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties
25/12/12 09:44:55 WARN Utils: Your hostname, LAPTOP-A2FP9AQK, resolves to a loopback address: 127.0.1.1; using 10.255.255.254 instead (on interface lo)
25/12/12 09:44:55 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/12/12 09:44:57 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

âœ… Spark Session Created!
   App Name: PySpark Fundamentals
   Spark Version: 4.0.1
   Master: local[*]

In [3]:
# ============================================
# STEP 2: CREATE YOUR FIRST DATAFRAME
# We'll use employee data
# ============================================

print("\n" + "="*70)
print("STEP 2: CREATE YOUR FIRST DATAFRAME")
print("="*70)

# Our dummy data - List of tuples
employees = [
    (1, "John Smith", 28, "Engineering", 75000, "2020-01-15"),
    (2, "Sarah Johnson", 32, "Marketing", 68000, "2019-03-20"),
    (3, "Mike Wilson", 45, "Sales", 82000, "2018-07-10"),
    (4, "Emily Davis", 29, "Engineering", 79000, "2021-02-01"),
    (5, "David Brown", 38, "HR", 65000, "2019-11-05"),
    (6, "Lisa Anderson", 35, "Engineering", 85000, "2020-06-15"),
    (7, "Tom Martinez", 42, "Sales", 78000, "2018-09-20"),
    (8, "Anna Taylor", 31, "Marketing", 71000, "2020-04-10"),
    (9, "James Lee", 27, "Engineering", 73000, "2021-08-01"),
    (10, "Maria Garcia", 36, "HR", 67000, "2019-05-25")
]

# Column names
columns = ["emp_id", "name", "age", "department", "salary", "join_date"]

# Create DataFrame
df = spark.createDataFrame(employees, columns)

print("âœ… DataFrame Created!")
print("\nðŸ“Š Our Employee Data:")
df.show()

======================================================================
STEP 2: CREATE YOUR FIRST DATAFRAME
======================================================================
âœ… DataFrame Created!

ðŸ“Š Our Employee Data:

+------+-------------+---+-----------+------+----------+
|emp_id|         name|age| department|salary| join_date|
+------+-------------+---+-----------+------+----------+
|     1|   John Smith| 28|Engineering| 75000|2020-01-15|
|     2|Sarah Johnson| 32|  Marketing| 68000|2019-03-20|
|     3|  Mike Wilson| 45|      Sales| 82000|2018-07-10|
|     4|  Emily Davis| 29|Engineering| 79000|2021-02-01|
|     5|  David Brown| 38|         HR| 65000|2019-11-05|
|     6|Lisa Anderson| 35|Engineering| 85000|2020-06-15|
|     7| Tom Martinez| 42|      Sales| 78000|2018-09-20|
|     8|  Anna Taylor| 31|  Marketing| 71000|2020-04-10|
|     9|    James Lee| 27|Engineering| 73000|2021-08-01|
|    10| Maria Garcia| 36|         HR| 67000|2019-05-25|
+------+-------------+---+-----------+------+----------+

In [5]:
print("\nðŸ“‹ DataFrame Schema (data types):")
df.printSchema()

print(f"\nðŸ“ˆ Total Rows: {df.count()}")
print(f"ðŸ“Š Total Columns: {len(df.columns)}")
print(f"ðŸ·ï¸  Column Names: {df.columns}")

ðŸ“‹ DataFrame Schema (data types):
root
 |-- emp_id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- age: long (nullable = true)
 |-- department: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- join_date: string (nullable = true)


ðŸ“ˆ Total Rows: 10
ðŸ“Š Total Columns: 6
ðŸ·ï¸  Column Names: ['emp_id', 'name', 'age', 'department', 'salary', 'join_date']

In [6]:
# ============================================
# STEP 3: BASIC DATAFRAME OPERATIONS
# ============================================

print("\n" + "="*70)
print("STEP 3: BASIC DATAFRAME OPERATIONS")
print("="*70)

# 3.1 SELECT - Choose specific columns
print("\nðŸ”¹ 3.1 SELECT: Choose specific columns")
print("Show only name and salary:")
df.select("name", "salary").show(5)

======================================================================
STEP 3: BASIC DATAFRAME OPERATIONS
======================================================================

ðŸ”¹ 3.1 SELECT: Choose specific columns
Show only name and salary:
+-------------+------+
|         name|salary|
+-------------+------+
|   John Smith| 75000|
|Sarah Johnson| 68000|
|  Mike Wilson| 82000|
|  Emily Davis| 79000|
|  David Brown| 65000|
+-------------+------+
only showing top 5 rows

In [7]:
# 3.2 FILTER/WHERE - Filter rows based on condition
print("\nðŸ”¹ 3.2 FILTER: Get employees with salary > 75000")
df.filter(df.salary > 75000).show()

ðŸ”¹ 3.2 FILTER: Get employees with salary > 75000
+------+-------------+---+-----------+------+----------+
|emp_id|         name|age| department|salary| join_date|
+------+-------------+---+-----------+------+----------+
|     3|  Mike Wilson| 45|      Sales| 82000|2018-07-10|
|     4|  Emily Davis| 29|Engineering| 79000|2021-02-01|
|     6|Lisa Anderson| 35|Engineering| 85000|2020-06-15|
|     7| Tom Martinez| 42|      Sales| 78000|2018-09-20|
+------+-------------+---+-----------+------+----------+

In [8]:
print("\nðŸ”¹ Alternative syntax using WHERE:")
df.where(df.salary > 75000).show()

ðŸ”¹ Alternative syntax using WHERE:
+------+-------------+---+-----------+------+----------+
|emp_id|         name|age| department|salary| join_date|
+------+-------------+---+-----------+------+----------+
|     3|  Mike Wilson| 45|      Sales| 82000|2018-07-10|
|     4|  Emily Davis| 29|Engineering| 79000|2021-02-01|
|     6|Lisa Anderson| 35|Engineering| 85000|2020-06-15|
|     7| Tom Martinez| 42|      Sales| 78000|2018-09-20|
+------+-------------+---+-----------+------+----------+

In [9]:
# 3.3 Multiple conditions
print("\nðŸ”¹ 3.3 MULTIPLE CONDITIONS: Engineering dept AND salary > 75000")
df.filter((df.department == "Engineering") & (df.salary > 75000)).show()

ðŸ”¹ 3.3 MULTIPLE CONDITIONS: Engineering dept AND salary > 75000
+------+-------------+---+-----------+------+----------+
|emp_id|         name|age| department|salary| join_date|
+------+-------------+---+-----------+------+----------+
|     4|  Emily Davis| 29|Engineering| 79000|2021-02-01|
|     6|Lisa Anderson| 35|Engineering| 85000|2020-06-15|
+------+-------------+---+-----------+------+----------+

In [10]:
# 3.4 SELECT + FILTER combined
print("\nðŸ”¹ 3.4 COMBINING SELECT + FILTER:")
df.select("name", "department", "salary") \
  .filter(df.salary > 70000) \
  .show()

ðŸ”¹ 3.4 COMBINING SELECT + FILTER:
+-------------+-----------+------+
|         name| department|salary|
+-------------+-----------+------+
|   John Smith|Engineering| 75000|
|  Mike Wilson|      Sales| 82000|
|  Emily Davis|Engineering| 79000|
|Lisa Anderson|Engineering| 85000|
| Tom Martinez|      Sales| 78000|
|  Anna Taylor|  Marketing| 71000|
|    James Lee|Engineering| 73000|
+-------------+-----------+------+